snlkuharlocal/src/DataProcessors/ПечатьЗаданиеНабора/ПечатьЗаданиеНабора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьЗаданиеНабора</name>
  <attributes>
    <name>ТекДок</name>
    <type>
      <types>DocumentRef.ЗаданиеНабора</types>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопПараметры</name>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/РеквизитыДокументов/РеквизитыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыДокументов</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>DocumentRef.Матрица</types>
      <types>Boolean</types>
      <types>String</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef.Перемещение</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Матрица</types>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
      <types>DocumentRef.ЗаданиеНабора</types>
      <types>DocumentRef.СчетФактура</types>
      <types>DocumentRef.ЗаказКлиентаFBS</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ВидыШК/ВидыШК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыШК</name>
  <enumValues>
    <name>Основной</name>
  </enumValues>
  <enumValues>
    <name>Дополнительный</name>
  </enumValues>
  <enumValues>
    <name>Временный</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаданиеНабора/ЗаданиеНабора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНабора</name>
  <basedOn>Document.ПланНабора</basedOn>
  <registerRecords>AccumulationRegister.РезервыТМЦ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПланНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТСД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧасти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКомплектующие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБлочки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>String</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отгружен</name>
    <type>
      <types>EnumRef.Отгружен</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданоОбработкойПополнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сектор</name>
    <type>
      <types>CatalogRef.СектораХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнаяНакладная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьВПервуюОчередь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелТСД</name>
    <type>
      <types>ExchangePlanRef.МобильныеТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательныйНабор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборМиксами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяФормированиеНабораЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормированиеНаборовЧЗЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗНМ</name>
    <type>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </attributes>
  <attributes>
    <name>НеконтролироватьСканированиеЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМестоНаборщика</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресноеХранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделенная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущийЗНБ</name>
    <type>
      <types>DocumentRef.ЗаданиеНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастичноСобран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДляНаборов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяМаркировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланируемыеСостояния</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияНакладной</types>
      </type>
    </attributes>
    <attributes>
      <name>Пропустить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/ПечатьЗаданиеНабора/ManagerModule.bsl
#Область РазделениеТоваров

Функция РазделитьМаркированныеИНемаркированныеТовары(Накладная, МассивНоменклатурыЗНБ = Неопределено, ЗНБ = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Накладная", Накладная);
	Запрос.УстановитьПараметр("ЗНБ", ЗНБ);
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеквизитыДокументов.Документ КАК Перемещение
	|ПОМЕСТИТЬ вр_Перемещения
	|ИЗ
	|	РегистрСведений.РеквизитыДокументов КАК РеквизитыДокументов
	|ГДЕ
	|	РеквизитыДокументов.ИмяРеквизита = ""Связь_РНК_ПРМ""
	|	И РеквизитыДокументов.ЗначениеРеквизита = &Накладная
	|	И ТИПЗНАЧЕНИЯ(РеквизитыДокументов.Документ) = ТИП(Документ.Перемещение)
	|	И ТИПЗНАЧЕНИЯ(РеквизитыДокументов.ЗначениеРеквизита) = ТИП(Документ.РасходнаяНакладная)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТоварыПРМ.Номенклатура, КомплектующиеРНК.Номенклатура) КАК Номенклатура,
	|	МАКСИМУМ(ЕСТЬNULL(ТоварыПРМ.Количество, 0)) КАК Количество
	|ПОМЕСТИТЬ вр_НемаркированныеТовары
	|ИЗ
	|	Документ.Перемещение.Товары КАК ТоварыПРМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Комплектующие КАК КомплектующиеРНК
	|		ПО ТоварыПРМ.Номенклатура = КомплектующиеРНК.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_Перемещения КАК вр_Перемещения
	|		ПО ТоварыПРМ.Ссылка = вр_Перемещения.Перемещение
	|ГДЕ
	|	НЕ ТоварыПРМ.Ссылка.Склад.ЭтоСкладМаркированногоТовара
	|	И КомплектующиеРНК.Ссылка = &Накладная
	|	" + ?(МассивНоменклатурыЗНБ = Неопределено, "", "И ТоварыПРМ.Номенклатура В(&МассивНоменклатурыЗНБ)") + "
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыПРМ.Номенклатура, КомплектующиеРНК.Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТоварыПРМ.Номенклатура, КомплектующиеРНК.Номенклатура) КАК Номенклатура,
	|	МАКСИМУМ(ЕСТЬNULL(ТоварыПРМ.Количество, 0)) КАК Количество
	|ПОМЕСТИТЬ вр_МаркированныеТовары
	|ИЗ
	|	Документ.Перемещение.Товары КАК ТоварыПРМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Комплектующие КАК КомплектующиеРНК
	|		ПО ТоварыПРМ.Номенклатура = КомплектующиеРНК.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_Перемещения КАК вр_Перемещения
	|		ПО ТоварыПРМ.Ссылка = вр_Перемещения.Перемещение
	|ГДЕ
	|	ТоварыПРМ.Ссылка.Склад.ЭтоСкладМаркированногоТовара
	|	И КомплектующиеРНК.Ссылка = &Накладная
	|	" + ?(МассивНоменклатурыЗНБ = Неопределено, "", "И ТоварыПРМ.Номенклатура В(&МассивНоменклатурыЗНБ)") + "
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыПРМ.Номенклатура, КомплектующиеРНК.Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТоварыПРМ.Номенклатура, КомплектующиеРНК.Номенклатура) КАК Номенклатура,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(КомплектующиеРНК.Количество, 0) - ЕСТЬNULL(ТоварыПРМ.Количество, 0) > 0
	|				ТОГДА ЕСТЬNULL(КомплектующиеРНК.Количество, 0) - ЕСТЬNULL(ТоварыПРМ.Количество, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Количество
	|ПОМЕСТИТЬ вр_ТоварыНеСовпадаетКоличество
	|ИЗ
	|	Документ.Перемещение.Товары КАК ТоварыПРМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Комплектующие КАК КомплектующиеРНК
	|		ПО ТоварыПРМ.Номенклатура = КомплектующиеРНК.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_Перемещения КАК вр_Перемещения
	|		ПО ТоварыПРМ.Ссылка = вр_Перемещения.Перемещение
	|ГДЕ
	|	КомплектующиеРНК.Ссылка = &Накладная
	|	И ЕСТЬNULL(КомплектующиеРНК.Количество, 0) - ЕСТЬNULL(ТоварыПРМ.Количество, 0) > 0
	|	" + ?(МассивНоменклатурыЗНБ = Неопределено, "", "И КомплектующиеРНК.Номенклатура В(&МассивНоменклатурыЗНБ)") + "
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыПРМ.Номенклатура, КомплектующиеРНК.Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Комплектующие.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Комплектующие.Количество, 0) КАК Количество
	|ПОМЕСТИТЬ вр_ЕстьВРНК_НетВПРМ
	|ИЗ
	|	Документ.РасходнаяНакладная.Комплектующие КАК Комплектующие
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Перемещение.Товары КАК ПеремещениеТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_Перемещения КАК вр_Перемещения
	|			ПО ПеремещениеТовары.Ссылка = вр_Перемещения.Перемещение
	|		ПО Комплектующие.Номенклатура = ПеремещениеТовары.Номенклатура
	|ГДЕ
	|	Комплектующие.Ссылка = &Накладная
	|	И ПеремещениеТовары.Номенклатура ЕСТЬ NULL
	|	" + ?(МассивНоменклатурыЗНБ = Неопределено, "", "И Комплектующие.Номенклатура В(&МассивНоменклатурыЗНБ)") + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_МаркированныеТовары.Номенклатура КАК Номенклатура,
	|	0 КАК Количество,
	|	вр_МаркированныеТовары.Количество КАК КоличествоЧЗ
	|ПОМЕСТИТЬ вр_Сводная
	|ИЗ
	|	вр_МаркированныеТовары КАК вр_МаркированныеТовары
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вр_ТоварыНеСовпадаетКоличество.Номенклатура,
	|	0,
	|	вр_ТоварыНеСовпадаетКоличество.Количество
	|ИЗ
	|	вр_ТоварыНеСовпадаетКоличество КАК вр_ТоварыНеСовпадаетКоличество
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вр_ЕстьВРНК_НетВПРМ.Номенклатура,
	|	0,
	|	вр_ЕстьВРНК_НетВПРМ.Количество
	|ИЗ
	|	вр_ЕстьВРНК_НетВПРМ КАК вр_ЕстьВРНК_НетВПРМ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вр_НемаркированныеТовары.Номенклатура,
	|	вр_НемаркированныеТовары.Количество,
	|	0
	|ИЗ
	|	вр_НемаркированныеТовары КАК вр_НемаркированныеТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Сводная.Номенклатура КАК Номенклатура,
	|	СУММА(вр_Сводная.Количество) КАК Количество,
	|	СУММА(вр_Сводная.КоличествоЧЗ) КАК КоличествоЧЗ
	|ИЗ
	|	вр_Сводная КАК вр_Сводная
	|
	|СГРУППИРОВАТЬ ПО
	|	вр_Сводная.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеквизитыДокументов.Документ КАК Перемещение
	|ПОМЕСТИТЬ вр_Перемещения
	|ИЗ
	|	РегистрСведений.РеквизитыДокументов КАК РеквизитыДокументов
	|ГДЕ  
	//++Данилова Е.В. 11.12.2025  HELP-8148 
	//|	РеквизитыДокументов.ИмяРеквизита = ""Связь_РНК_ПРМ""
	|	РеквизитыДокументов.ИмяРеквизита ПОДОБНО ""Связь_РНК_ПРМ%""
	//--Данилова Е.В. 11.12.2025
	|	И РеквизитыДокументов.ЗначениеРеквизита = &Накладная
	|	И ТИПЗНАЧЕНИЯ(РеквизитыДокументов.Документ) = ТИП(Документ.Перемещение)
	|	И ТИПЗНАЧЕНИЯ(РеквизитыДокументов.ЗначениеРеквизита) = ТИП(Документ.РасходнаяНакладная)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыЗНБ.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ТоварыЗНБ.Количество) КАК Количество,
	|	МАКСИМУМ(ТоварыЗНБ.ТребуетсяМаркировка) КАК ТребуетсяМаркировка
	|ПОМЕСТИТЬ вр_ЗНБ
	|ИЗ
	|	Документ.ЗаданиеНабора.Товары КАК ТоварыЗНБ
	|ГДЕ
	|	ТоварыЗНБ.Ссылка = &ЗНБ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыЗНБ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТоварыПРМ.Номенклатура, вр_ЗНБ.Номенклатура) КАК Номенклатура,
	|	МАКСИМУМ(ЕСТЬNULL(вр_ЗНБ.Количество, 0)) КАК Количество
	|ПОМЕСТИТЬ вр_НемаркированныеТовары
	|ИЗ
	|	Документ.Перемещение.Товары КАК ТоварыПРМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_ЗНБ КАК вр_ЗНБ
	|		ПО ТоварыПРМ.Номенклатура = вр_ЗНБ.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_Перемещения КАК вр_Перемещения
	|		ПО ТоварыПРМ.Ссылка = вр_Перемещения.Перемещение
	|ГДЕ
	|	НЕ ТоварыПРМ.Ссылка.Склад.ЭтоСкладМаркированногоТовара
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыПРМ.Номенклатура, вр_ЗНБ.Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТоварыПРМ.Номенклатура, вр_ЗНБ.Номенклатура) КАК Номенклатура,
	|	МАКСИМУМ(ЕСТЬNULL(вр_ЗНБ.Количество, 0)) КАК Количество
	|ПОМЕСТИТЬ вр_МаркированныеТовары
	|ИЗ
	|	Документ.Перемещение.Товары КАК ТоварыПРМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_ЗНБ КАК вр_ЗНБ
	|		ПО ТоварыПРМ.Номенклатура = вр_ЗНБ.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_Перемещения КАК вр_Перемещения
	|		ПО ТоварыПРМ.Ссылка = вр_Перемещения.Перемещение
	|ГДЕ
	|	ТоварыПРМ.Ссылка.Склад.ЭтоСкладМаркированногоТовара
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыПРМ.Номенклатура, вр_ЗНБ.Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_МаркированныеТовары.Номенклатура КАК Номенклатура,
	|	0 КАК Количество,
	|	вр_МаркированныеТовары.Количество КАК КоличествоЧЗ
	|ПОМЕСТИТЬ вр_Сводная
	|ИЗ
	|	вр_МаркированныеТовары КАК вр_МаркированныеТовары
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вр_НемаркированныеТовары.Номенклатура,
	|	вр_НемаркированныеТовары.Количество,
	|	0
	|ИЗ
	|	вр_НемаркированныеТовары КАК вр_НемаркированныеТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Сводная.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(вр_Сводная.Количество) КАК Количество,
	|	МАКСИМУМ(вр_Сводная.КоличествоЧЗ) КАК КоличествоЧЗ
	|ПОМЕСТИТЬ вр_Объединение
	|ИЗ
	|	вр_Сводная КАК вр_Сводная
	|
	|СГРУППИРОВАТЬ ПО
	|	вр_Сводная.Номенклатура
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	//++Данилова Е.В. 23.10.2025 без задачи 
	|ВЫБРАТЬ
	|	вр_ЗНБ.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(вр_Объединение.КоличествоЧЗ, 0) <> 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА вр_Объединение.Количество ЕСТЬ NULL
	|					ТОГДА ВЫБОР
	|							КОГДА вр_ЗНБ.ТребуетсяМаркировка
	|								ТОГДА 0
	|							ИНАЧЕ вр_ЗНБ.Количество
	|						КОНЕЦ
	|				ИНАЧЕ вр_Объединение.Количество
	|			КОНЕЦ
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА вр_Объединение.КоличествоЧЗ ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА вр_ЗНБ.ТребуетсяМаркировка
	|						ТОГДА вр_ЗНБ.Количество
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ вр_Объединение.КоличествоЧЗ
	|	КОНЕЦ КАК КоличествоЧЗ
	|ИЗ
	|	вр_ЗНБ КАК вр_ЗНБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ вр_Объединение КАК вр_Объединение
	|		ПО вр_ЗНБ.Номенклатура = вр_Объединение.Номенклатура 
	//--Данилова Е.В. 23.10.2025
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";

	УстановитьПривилегированныйРежим(Истина);
	тзТовары = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат тзТовары;
	
КонецФункции
 
Функция ЭтоСкладСмешанныеСпайки(ДокОбъект) Экспорт
	
	Если ТипЗнч(ДокОбъект.Ссылка) = Тип("ДокументСсылка.ЗаданиеНабора") Тогда
		Если ЗначениеЗаполнено(ДокОбъект.Накладная) И ЕстьРеквизитДокумента("Склад", ДокОбъект.Накладная.Метаданные()) Тогда
			Склад = ДокОбъект.Накладная.Склад;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокОбъект.Ссылка) = Тип("ДокументСсылка.ПланНабора") Тогда
		Если ЗначениеЗаполнено(ДокОбъект.ДокОснование) И ЕстьРеквизитДокумента("Склад", ДокОбъект.ДокОснование.Метаданные()) Тогда
			Склад = ДокОбъект.ДокОснование.Склад;	
		Иначе
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокОбъект.Ссылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		Склад = ДокОбъект.Склад;	
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	СкладСмешанныеСпайки = Документы.ЗаказСмешанныхСпаекFBO.ПолучитьЗначениеРеквизитыСправочников(, "СкладСмешанныеСпайки", Истина);
	
	Возврат ?(Склад = СкладСмешанныеСпайки, Истина, Ложь);
	
КонецФункции

Функция ПолучитьТаблицуССекторамиИНаборщиками(ДокСсылка, тзТовары) Экспорт
	
	Запрос = Новый Запрос;
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ПланНабора") Тогда
		Запрос.УстановитьПараметр("ПланНабора", ДокСсылка);
	ИначеЕсли ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ЗаданиеНабора") Тогда
		Запрос.УстановитьПараметр("ПланНабора", ДокСсылка.ДокументОснование);
	КонецЕсли;
	Запрос.УстановитьПараметр("тзТовары", тзТовары);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(тзТовары.Количество КАК ЧИСЛО) КАК Количество
	|ПОМЕСТИТЬ вр_Товары
	|ИЗ
	|	&тзТовары КАК тзТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тБрэндов.Брэнд КАК Брэнд,
	|	тБрэндов.Коллекция КАК Коллекция,
	|	тБрэндов.Наборщик КАК Наборщик,
	|	тБрэндов.СекторХранения КАК СекторХранения
	|ПОМЕСТИТЬ вр_ПланНабора
	|ИЗ
	|	Документ.ПланНабора.тБрэндов КАК тБрэндов
	|ГДЕ
	|	тБрэндов.Ссылка = &ПланНабора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Товары.Номенклатура КАК Номенклатура,
	|	вр_Товары.Количество КАК Количество,
	|	вр_ПланНабора.Брэнд КАК Брэнд,
	|	вр_ПланНабора.Коллекция КАК Коллекция,
	|	вр_ПланНабора.Наборщик КАК Наборщик,
	|	вр_ПланНабора.СекторХранения КАК СекторХранения
	|ИЗ
	|	вр_Товары КАК вр_Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_ПланНабора КАК вр_ПланНабора
	|		ПО вр_Товары.Номенклатура.Родитель.Родитель = вр_ПланНабора.Коллекция
	|			И вр_Товары.Номенклатура.Родитель.Родитель.Родитель = вр_ПланНабора.Брэнд
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наборщик,
	|	Брэнд,
	|	Коллекция";
	
	УстановитьПривилегированныйРежим(Истина);
	тзСводное = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат тзСводное;
	
КонецФункции

#КонецОбласти

#Область ПечатьСмешанныеСпайки

Функция ПечатьЗаданияНабораСмешанныеСпайки(ДокОбъект, Макет, ДопПараметрыНакладной) Экспорт
	
	МассивЗНБ = Новый Массив;
	
	Если ТипЗнч(ДокОбъект.Ссылка) = Тип("ДокументСсылка.ПланНабора") Тогда
		
		Накладная = ДокОбъект.ДокОснование;
		ПланНабора = ДокОбъект.Ссылка;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ПланНабора", ПланНабора);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаданиеНабора.Ссылка КАК ЗНБ
		|ИЗ
		|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
		|ГДЕ
		|	ЗаданиеНабора.ДокументОснование = &ПланНабора
		|	И ЗаданиеНабора.Проведен";
		
		УстановитьПривилегированныйРежим(Истина);
		МассивЗНБ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗНБ");
		УстановитьПривилегированныйРежим(Ложь);
		
	ИначеЕсли ТипЗнч(ДокОбъект.Ссылка) = Тип("ДокументСсылка.ЗаданиеНабора") Тогда
		
		Накладная = ДокОбъект.Накладная;
		ПланНабора = ДокОбъект.ДокументОснование;
		
		МассивЗНБ.Добавить(ДокОбъект.Ссылка);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	//////////////// ДАННЫЕ ИЗ НАКЛАДНОЙ //////////////////////////////////////////////
	ОтгрузкаКомплектов= Накладная.ОтгрузкаКомплектов;
	
	ВидНакладной				= "РасходнаяНакладная";
	ВидНакладнойПредставление	= "РНК";	
	
	ТД = Новый ТабличныйДокумент;
	ТД.Очистить();
	ТД.ИмяПараметровПечати = "ПН_СмешанныеСпайки";
	ТД.ОтображатьСетку = Ложь;
	
	ОблЗаголовок	= Макет.ПолучитьОбласть("Заголовок");
	ОблШапка	    = Макет.ПолучитьОбласть("ШапкаЧЗ");
	ОблСтрока	    = Макет.ПолучитьОбласть("СтрокаЧЗ");
	ОблПодвал       = Макет.ПолучитьОбласть("ПодвалЧЗ");
	
	ОблТекст 	= Макет.ПолучитьОбласть("Текст");
	
	ОблЗаголовок.Параметры.Заголовок ="К накладной: "+ВидНакладнойПредставление+" "+Накладная.Номер+" от "+Формат(Накладная.Дата,"ДФ=dd.MM.yyyy");
	ОблЗаголовок.Параметры.Заполнить(Накладная);
	ОблЗаголовок.Параметры.ГруппыТоваров = "";        //ТЮА
	ОблЗаголовок.Параметры.ДатаОтгрузки  = Формат(Накладная.ДатаОтгрузки,"ДФ=dd.MM.yyyy");
	
	ДатаАвизации = ОблЗаголовок.Параметры.ДатаОтгрузки; 
	ВремяПриемки = ПолучитьВремяПриемки(Накладная); 	
	
	СтрокаДатыВремениДоставки = "";
	
	Если ЗначениеЗаполнено(ДатаАвизации) Тогда
		СтрокаДатыВремениДоставки=СтрокаДатыВремениДоставки+"отгрузка: "+ДатаАвизации;			 
		Если ЗначениеЗаполнено(ВремяПриемки) тогда
			СтрокаДатыВремениДоставки=СтрокаДатыВремениДоставки+" "+ВремяПриемки;
		КонецЕсли;		
	КонецЕсли;
	
	РайонДоставки=ПолучитьРеквизитШапки(Накладная,"ПунктДоставки.РайонДоставки","Документ");
	Если НЕ ЗначениеЗаполнено(РайонДоставки) Тогда
		РайонДоставки=ПолучитьРеквизитШапки(Накладная,"Контрагент.РайонДоставки","Документ");
	КонецЕсли;	
	
	ОблЗаголовок.Параметры.РайонДоставкиПечать = "Район доставки: "+РайонДоставки+".Сектор: "+РайонДоставки.Сектор;		
	ОблЗаголовок.Параметры.ДопОбработка        = ТекстДопОбработки(Накладная);
	//////////////// ДАННЫЕ ИЗ НАКЛАДНОЙ //////////////////////////////////////////////
	
	//////////////// ОБХОДИМ ЗНБ //////////////////////////////////////////////////////
	Для Каждого ЗНБ ИЗ МассивЗНБ Цикл
		
		тзТовары = РазделитьМаркированныеИНемаркированныеТовары(Накладная, Неопределено, ЗНБ);
		
		Если тзТовары.Количество() = 0 Тогда
			Продолжить;
		Конецесли;
		
		//==================================================================================================
		/////// НА ПЛАТФОРМЕ х64 РИСУНОК НЕ ВЫВОДИТСЯ /////////////////////////////////
		СистемнаяИнформация = Новый СистемнаяИнформация;
		Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
			Рисунок				  = ОблЗаголовок.Рисунки.ОбъектШК;
			ОбъектШК			  = Рисунок.Объект;	
			ОбъектШК.Сообщение	  = СформироватьШКДокаСервер(ЗНБ);
		КонецЕсли;
		//==================================================================================================
	
		СтрокаПН = ПолучитьДанныеПервойСтроки(Накладная);	
	
		ОблЗаголовок.Параметры.Склад				= ПолучитьРеквизитШапки(Накладная,"Склад","Документ");
		ОблЗаголовок.Параметры.Наборщик				= ПолучитьНаборщика(ЗНБ);	
		ОблЗаголовок.Параметры.Сканировщик			= СтрокаПН.Сканировщик;
		
		КоличествоОбщее = 0;
		Для Каждого СтрокаТЧ ИЗ тзТовары Цикл
			КоличествоОбщее = КоличествоОбщее + СтрокаТЧ.Количество + СтрокаТЧ.КоличествоЧЗ;	
		КонецЦикла;
		ОблЗаголовок.Параметры.КоличествоОбщее	= "Кол-во всего: " + КоличествоОбщее;
		
		ТД.Вывести(ОблЗаголовок);
		ТД.Вывести(ОблШапка);
		
		///////////////////////////////////////////////////////////////////////////////
		
		Сч = 0; ИтогоКоличество = 0; ИтогоКоличествоЧЗ = 0;
		
		ТД.Вывести(ОблТекст);
		Для Каждого СтрокаТЧ ИЗ тзТовары Цикл
			
			Если СтрокаТЧ.Количество = 0 И СтрокаТЧ.КоличествоЧЗ = 0 Тогда Продолжить КонецЕсли;
			
			Сч=Сч+1;
			
			ОблСтрока.Параметры.Товары 		= СтрокаТЧ.Номенклатура;
			ОблСтрока.Параметры.НПП 		= Сч;
			ОблСтрока.Параметры.ШК 			= ПолучитьШтрихКодТовара(СтрокаТЧ.Номенклатура,Перечисления.ТипыШтрихКодов.Штука,Перечисления.ВидыШК.Основной);
			ОблСтрока.Параметры.Количество	= СтрокаТЧ.Количество;
			ОблСтрока.Параметры.КоличествоЧЗ= СтрокаТЧ.КоличествоЧЗ;
			
			ИтогоКоличество	= ИтогоКоличество + СтрокаТЧ.Количество;
			ИтогоКоличествоЧЗ = ИтогоКоличествоЧЗ + СтрокаТЧ.КоличествоЧЗ;
			
			ТД.Вывести(ОблСтрока);			
		КонецЦикла;
		
		ОблПодвал.Параметры.КоличествоСтрок	= Сч;
		ОблПодвал.Параметры.Количество		= ИтогоКоличество;
		ОблПодвал.Параметры.КоличествоЧЗ	= ИтогоКоличествоЧЗ;
		ТД.Вывести(ОблПодвал);
		
		УстановитьКолонтитулыТД(ТД);
		
		ТД.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
	
	Возврат ТД;
	
КонецФункции

Процедура УстановитьКолонтитулыТД(ТД, ПопожениеКолонтитула="Верхний")
	
	Если ПопожениеКолонтитула="Верхний" Тогда
		Колонтитул=ТД.ВерхнийКолонтитул;
	Иначе
		Колонтитул=ТД.НижнийКолонтитул;	
	КонецЕсли; 
	
	Колонтитул.Выводить=Истина;
	Колонтитул.ВертикальноеПоложение=ВертикальноеПоложение.Верх;
	
	Колонтитул.ТекстСлева="Сформирован: "+СокрЛП(ПараметрыСеанса.Пользователь)+", "+ТекущаяДата();	
	Колонтитул.ТекстСлева=СтрЗаменить(Колонтитул.ТекстСлева," ",Символы.НПП);  
	
	Колонтитул.ТекстСправа="Стр. № [&НомерСтраницы]из [&СтраницВсего]";
	
КонецПроцедуры

Функция ПолучитьДанныеПервойСтроки(ДокОбъект)
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	*
	|ИЗ
	|	Документ.ПланНабора.тБрэндов
	|ГДЕ
	|	Ссылка.Проведен И Ссылка.Накладная=&РНК
	|";
	
	Запрос.УстановитьПараметр("РНК",ДокОбъект.Ссылка);
	
	РезультатЗапроса=Запрос.Выполнить().Выгрузить();
	Результат=Новый Структура;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Результат.Вставить(Колонка.Имя,Неопределено);	
		Если РезультатЗапроса.Количество()>0 Тогда
			Результат[Колонка.Имя]=РезультатЗапроса[0][Колонка.Имя];
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции

Функция ПолучитьНаборщика(ЗНБ_Объект)
	
	Результат=Справочники.ФизическиеЛица.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПланНаборатБрэндов.Наборщик КАК Наборщик
	|ИЗ
	|	Документ.ПланНабора.тБрэндов КАК ПланНаборатБрэндов
	|ГДЕ
	|	ПланНаборатБрэндов.Ссылка = &ПланНабора
	|	И ПланНаборатБрэндов.НомерЧасти = &НомерЧасти";
	
	Запрос.УстановитьПараметр("ПланНабора",ЗНБ_Объект.ДокументОснование);
	Запрос.УстановитьПараметр("НомерЧасти",ЗНБ_Объект.НомерЧасти);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Наборщик) Тогда
		Результат = Выборка.Наборщик;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция ТекстДопОбработки(Накладная)
	ДопОбработка = ?(ТребуетсяДопОбработка(Накладная),"Требуется доп. обработка !","Доп. обработка не требуется");
	Возврат ДопОбработка;
КонецФункции //ТребуетсяДопОбработка(ДокСсылка) 

#КонецОбласти

#Область КодировкаСлужебные

Функция СформироватьШКДокаСервер(Док) Экспорт
	Если Док.Пустая() Тогда Возврат "" КонецЕсли;
	КодИсх="*"+ИдПоВидуДокумента(Док.Метаданные().Имя)+"*"+Док.Номер+"*"+Прав(""+Год(Док.Дата),2)+"*";		
	Возврат Закодировать64Сервер(КодИсх);
КонецФункции //СформироватьШКДока

Функция Закодировать64Сервер(НачСтр) Экспорт
	База="ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
	
	Стр=НачСтр;
	
	Остаток=СтрДлина(Стр) % 3;
	НеХватает=?(Остаток=0,0,3-Остаток); 
	
	Для Сч=1 по НеХватает Цикл
		Стр=Стр+" ";	    
	КонецЦикла;	
	    
	СтрокаБит="";
	
	Длина=СтрДлина(Стр);
	
	ПолнаяСтрока="";
	Для Сч=1 По Длина Цикл
		СтрокаБит=СтрокаБит+Бинарное(БайтовыйКодСимволаСервер(Сред(Стр,Сч,1)));		
	КонецЦикла;
	
	СтрокаКода="";
	Пока СтрДлина(СтрокаБит)>0 Цикл		
		БитовоеЗначение="00"+Лев(СтрокаБит,6);
		
		СтрокаКода	=СтрокаКода+Сред(База,Десятичное(БитовоеЗначение)+1,1);			    
		СтрокаБит	=Сред(СтрокаБит,7);
	КонецЦикла;                                                      
	
	Возврат СтрокаКода;	
КонецФункции // 

Функция БайтовыйКодСимволаСервер(Символ) Экспорт
	Возврат ЗаполнитьКодировки().КодировкаПрямая[Символ];
КонецФункции // КодСимвола()

Функция СимволПоБайтовомуКоду(Код)
	Возврат ЗаполнитьКодировки().КодировкаОбратная[Код];
КонецФункции // ()
  
Функция Бинарное(НачЗн)
	Зн=НачЗн;	
	Стр="";	
	Для Сч=1 по 8 Цикл
		Бит=Зн%2;
		
		Стр=""+Бит+Стр;   
		Зн=(Зн-Бит)/2;		
	КонецЦикла;     
	
	Возврат Стр;
КонецФункции //

Функция Десятичное(НачЗн)
	Зн=0;
	База=128;
	
	ТекДлинна=Мин(СтрДлина(НачЗн),8);
	
	Для Сч=1 по ТекДлинна Цикл
		Зн=Зн+База*Число(Сред(НачЗн,Сч,1));					    
		База=База/2;
	КонецЦикла;
	
	Возврат Зн;
КонецФункции //Десятичное

Функция ИдПоВидуДокумента(Вид)
	Возврат Метаданные.Документы[Вид].Синоним;	
КонецФункции //ВнутреннийИдВидаДокумента
 
Функция ЗаполнитьКодировки()
	
	КодировкаПрямая=Новый Соответствие;
	
	КодировкаПрямая.Вставить(" ",32);
	КодировкаПрямая.Вставить("!",33);
	КодировкаПрямая.Вставить("""",34);
	КодировкаПрямая.Вставить("#",35);
	КодировкаПрямая.Вставить("$",36);
	КодировкаПрямая.Вставить("%",37);
	КодировкаПрямая.Вставить("&",38);
	КодировкаПрямая.Вставить("'",39);
	КодировкаПрямая.Вставить("(",40);
	КодировкаПрямая.Вставить(")",41);
	КодировкаПрямая.Вставить("*",42);
	КодировкаПрямая.Вставить("+",43);
	КодировкаПрямая.Вставить(",",44);
	КодировкаПрямая.Вставить("-",45);
	КодировкаПрямая.Вставить(".",46);
	КодировкаПрямая.Вставить("/",47);
	КодировкаПрямая.Вставить("0",48);
	КодировкаПрямая.Вставить("1",49);
	КодировкаПрямая.Вставить("2",50);
	КодировкаПрямая.Вставить("3",51);
	КодировкаПрямая.Вставить("4",52);
	КодировкаПрямая.Вставить("5",53);
	КодировкаПрямая.Вставить("6",54);
	КодировкаПрямая.Вставить("7",55);
	КодировкаПрямая.Вставить("8",56);
	КодировкаПрямая.Вставить("9",57);
	КодировкаПрямая.Вставить(":",58);
	КодировкаПрямая.Вставить(";",59);
	КодировкаПрямая.Вставить("<",60);
	КодировкаПрямая.Вставить("=",61);
	КодировкаПрямая.Вставить(">",62);
	КодировкаПрямая.Вставить("?",63);
	КодировкаПрямая.Вставить("@",64);
	КодировкаПрямая.Вставить("A",65);
	КодировкаПрямая.Вставить("B",66);
	КодировкаПрямая.Вставить("C",67);
	КодировкаПрямая.Вставить("D",68);
	КодировкаПрямая.Вставить("E",69);
	КодировкаПрямая.Вставить("F",70);
	КодировкаПрямая.Вставить("G",71);
	КодировкаПрямая.Вставить("H",72);
	КодировкаПрямая.Вставить("I",73);
	КодировкаПрямая.Вставить("J",74);
	КодировкаПрямая.Вставить("K",75);
	КодировкаПрямая.Вставить("L",76);
	КодировкаПрямая.Вставить("M",77);
	КодировкаПрямая.Вставить("N",78);
	КодировкаПрямая.Вставить("O",79);
	КодировкаПрямая.Вставить("P",80);
	КодировкаПрямая.Вставить("Q",81);
	КодировкаПрямая.Вставить("R",82);
	КодировкаПрямая.Вставить("S",83);
	КодировкаПрямая.Вставить("T",84);
	КодировкаПрямая.Вставить("U",85);
	КодировкаПрямая.Вставить("V",86);
	КодировкаПрямая.Вставить("W",87);
	КодировкаПрямая.Вставить("X",88);
	КодировкаПрямая.Вставить("Y",89);
	КодировкаПрямая.Вставить("Z",90);
	КодировкаПрямая.Вставить("[",91);
	КодировкаПрямая.Вставить("\",92);
	КодировкаПрямая.Вставить("]",93);
	КодировкаПрямая.Вставить("^",94);
	КодировкаПрямая.Вставить("_",95);
	КодировкаПрямая.Вставить("`",96);
	КодировкаПрямая.Вставить("a",97);
	КодировкаПрямая.Вставить("b",98);
	КодировкаПрямая.Вставить("c",99);
	КодировкаПрямая.Вставить("d",100);
	КодировкаПрямая.Вставить("e",101);
	КодировкаПрямая.Вставить("f",102);
	КодировкаПрямая.Вставить("g",103);
	КодировкаПрямая.Вставить("h",104);
	КодировкаПрямая.Вставить("i",105);
	КодировкаПрямая.Вставить("j",106);
	КодировкаПрямая.Вставить("k",107);
	КодировкаПрямая.Вставить("l",108);
	КодировкаПрямая.Вставить("m",109);
	КодировкаПрямая.Вставить("n",110);
	КодировкаПрямая.Вставить("o",111);
	КодировкаПрямая.Вставить("p",112);
	КодировкаПрямая.Вставить("q",113);
	КодировкаПрямая.Вставить("r",114);
	КодировкаПрямая.Вставить("s",115);
	КодировкаПрямая.Вставить("t",116);
	КодировкаПрямая.Вставить("u",117);
	КодировкаПрямая.Вставить("v",118);
	КодировкаПрямая.Вставить("w",119);
	КодировкаПрямая.Вставить("x",120);
	КодировкаПрямая.Вставить("y",121);
	КодировкаПрямая.Вставить("z",122);
	КодировкаПрямая.Вставить("{",123);
	КодировкаПрямая.Вставить("|",124);
	КодировкаПрямая.Вставить("}",125);
	КодировкаПрямая.Вставить("~",126);
	КодировкаПрямая.Вставить("",127);
	КодировкаПрямая.Вставить("Ђ",128);
	КодировкаПрямая.Вставить("Ѓ",129);
	КодировкаПрямая.Вставить("‚",130);
	КодировкаПрямая.Вставить("ѓ",131);
	КодировкаПрямая.Вставить("„",132);
	КодировкаПрямая.Вставить("…",133);
	КодировкаПрямая.Вставить("†",134);
	КодировкаПрямая.Вставить("‡",135);
	КодировкаПрямая.Вставить("€",136);
	КодировкаПрямая.Вставить("‰",137);
	КодировкаПрямая.Вставить("Љ",138);
	КодировкаПрямая.Вставить("‹",139);
	КодировкаПрямая.Вставить("Њ",140);
	КодировкаПрямая.Вставить("Ќ",141);
	КодировкаПрямая.Вставить("Ћ",142);
	КодировкаПрямая.Вставить("Џ",143);
	КодировкаПрямая.Вставить("ђ",144);
	КодировкаПрямая.Вставить("‘",145);
	КодировкаПрямая.Вставить("’",146);
	КодировкаПрямая.Вставить("“",147);
	КодировкаПрямая.Вставить("”",148);
	КодировкаПрямая.Вставить("•",149);
	КодировкаПрямая.Вставить("–",150);
	КодировкаПрямая.Вставить("—",151);
	КодировкаПрямая.Вставить("",152);
	КодировкаПрямая.Вставить("™",153);
	КодировкаПрямая.Вставить("љ",154);
	КодировкаПрямая.Вставить("›",155);
	КодировкаПрямая.Вставить("њ",156);
	КодировкаПрямая.Вставить("ќ",157);
	КодировкаПрямая.Вставить("ћ",158);
	КодировкаПрямая.Вставить("џ",159);
	КодировкаПрямая.Вставить(" ",160);
	КодировкаПрямая.Вставить("Ў",161);
	КодировкаПрямая.Вставить("ў",162);
	КодировкаПрямая.Вставить("Ј",163);
	КодировкаПрямая.Вставить("¤",164);
	КодировкаПрямая.Вставить("Ґ",165);
	КодировкаПрямая.Вставить("¦",166);
	КодировкаПрямая.Вставить("§",167);
	КодировкаПрямая.Вставить("Ё",168);
	КодировкаПрямая.Вставить("©",169);
	КодировкаПрямая.Вставить("Є",170);
	КодировкаПрямая.Вставить("«",171);
	КодировкаПрямая.Вставить("¬",172);
	КодировкаПрямая.Вставить("",173);
	КодировкаПрямая.Вставить("®",174);
	КодировкаПрямая.Вставить("Ї",175);
	КодировкаПрямая.Вставить("°",176);
	КодировкаПрямая.Вставить("±",177);
	КодировкаПрямая.Вставить("І",178);
	КодировкаПрямая.Вставить("і",179);
	КодировкаПрямая.Вставить("ґ",180);
	КодировкаПрямая.Вставить("µ",181);
	КодировкаПрямая.Вставить("¶",182);
	КодировкаПрямая.Вставить("·",183);
	КодировкаПрямая.Вставить("ё",184);
	КодировкаПрямая.Вставить("№",185);
	КодировкаПрямая.Вставить("є",186);
	КодировкаПрямая.Вставить("»",187);
	КодировкаПрямая.Вставить("ј",188);
	КодировкаПрямая.Вставить("Ѕ",189);
	КодировкаПрямая.Вставить("ѕ",190);
	КодировкаПрямая.Вставить("ї",191);
	КодировкаПрямая.Вставить("А",192);
	КодировкаПрямая.Вставить("Б",193);
	КодировкаПрямая.Вставить("В",194);
	КодировкаПрямая.Вставить("Г",195);
	КодировкаПрямая.Вставить("Д",196);
	КодировкаПрямая.Вставить("Е",197);
	КодировкаПрямая.Вставить("Ж",198);
	КодировкаПрямая.Вставить("З",199);
	КодировкаПрямая.Вставить("И",200);
	КодировкаПрямая.Вставить("Й",201);
	КодировкаПрямая.Вставить("К",202);
	КодировкаПрямая.Вставить("Л",203);
	КодировкаПрямая.Вставить("М",204);
	КодировкаПрямая.Вставить("Н",205);
	КодировкаПрямая.Вставить("О",206);
	КодировкаПрямая.Вставить("П",207);
	КодировкаПрямая.Вставить("Р",208);
	КодировкаПрямая.Вставить("С",209);
	КодировкаПрямая.Вставить("Т",210);
	КодировкаПрямая.Вставить("У",211);
	КодировкаПрямая.Вставить("Ф",212);
	КодировкаПрямая.Вставить("Х",213);
	КодировкаПрямая.Вставить("Ц",214);
	КодировкаПрямая.Вставить("Ч",215);
	КодировкаПрямая.Вставить("Ш",216);
	КодировкаПрямая.Вставить("Щ",217);
	КодировкаПрямая.Вставить("Ъ",218);
	КодировкаПрямая.Вставить("Ы",219);
	КодировкаПрямая.Вставить("Ь",220);
	КодировкаПрямая.Вставить("Э",221);
	КодировкаПрямая.Вставить("Ю",222);
	КодировкаПрямая.Вставить("Я",223);
	КодировкаПрямая.Вставить("а",224);
	КодировкаПрямая.Вставить("б",225);
	КодировкаПрямая.Вставить("в",226);
	КодировкаПрямая.Вставить("г",227);
	КодировкаПрямая.Вставить("д",228);
	КодировкаПрямая.Вставить("е",229);
	КодировкаПрямая.Вставить("ж",230);
	КодировкаПрямая.Вставить("з",231);
	КодировкаПрямая.Вставить("и",232);
	КодировкаПрямая.Вставить("й",233);
	КодировкаПрямая.Вставить("к",234);
	КодировкаПрямая.Вставить("л",235);
	КодировкаПрямая.Вставить("м",236);
	КодировкаПрямая.Вставить("н",237);
	КодировкаПрямая.Вставить("о",238);
	КодировкаПрямая.Вставить("п",239);
	КодировкаПрямая.Вставить("р",240);
	КодировкаПрямая.Вставить("с",241);
	КодировкаПрямая.Вставить("т",242);
	КодировкаПрямая.Вставить("у",243);
	КодировкаПрямая.Вставить("ф",244);
	КодировкаПрямая.Вставить("х",245);
	КодировкаПрямая.Вставить("ц",246);
	КодировкаПрямая.Вставить("ч",247);
	КодировкаПрямая.Вставить("ш",248);
	КодировкаПрямая.Вставить("щ",249);
	КодировкаПрямая.Вставить("ъ",250);
	КодировкаПрямая.Вставить("ы",251);
	КодировкаПрямая.Вставить("ь",252);
	КодировкаПрямая.Вставить("э",253);
	КодировкаПрямая.Вставить("ю",254);
	КодировкаПрямая.Вставить("я",255);
	
	КодировкаОбратная=Новый Соответствие;
	
	КодировкаОбратная.Вставить(32," ");
	КодировкаОбратная.Вставить(33,"!");
	КодировкаОбратная.Вставить(34,"""");
	КодировкаОбратная.Вставить(35,"#");
	КодировкаОбратная.Вставить(36,"$");
	КодировкаОбратная.Вставить(37,"%");
	КодировкаОбратная.Вставить(38,"&");
	КодировкаОбратная.Вставить(39,"'");
	КодировкаОбратная.Вставить(40,"(");
	КодировкаОбратная.Вставить(41,")");
	КодировкаОбратная.Вставить(42,"*");
	КодировкаОбратная.Вставить(43,"+");
	КодировкаОбратная.Вставить(44,",");
	КодировкаОбратная.Вставить(45,"-");
	КодировкаОбратная.Вставить(46,".");
	КодировкаОбратная.Вставить(47,"/");
	КодировкаОбратная.Вставить(48,"0");
	КодировкаОбратная.Вставить(49,"1");
	КодировкаОбратная.Вставить(50,"2");
	КодировкаОбратная.Вставить(51,"3");
	КодировкаОбратная.Вставить(52,"4");
	КодировкаОбратная.Вставить(53,"5");
	КодировкаОбратная.Вставить(54,"6");
	КодировкаОбратная.Вставить(55,"7");
	КодировкаОбратная.Вставить(56,"8");
	КодировкаОбратная.Вставить(57,"9");
	КодировкаОбратная.Вставить(58,":");
	КодировкаОбратная.Вставить(59,";");
	КодировкаОбратная.Вставить(60,"<");
	КодировкаОбратная.Вставить(61,"=");
	КодировкаОбратная.Вставить(62,">");
	КодировкаОбратная.Вставить(63,"?");
	КодировкаОбратная.Вставить(64,"@");
	КодировкаОбратная.Вставить(65,"A");
	КодировкаОбратная.Вставить(66,"B");
	КодировкаОбратная.Вставить(67,"C");
	КодировкаОбратная.Вставить(68,"D");
	КодировкаОбратная.Вставить(69,"E");
	КодировкаОбратная.Вставить(70,"F");
	КодировкаОбратная.Вставить(71,"G");
	КодировкаОбратная.Вставить(72,"H");
	КодировкаОбратная.Вставить(73,"I");
	КодировкаОбратная.Вставить(74,"J");
	КодировкаОбратная.Вставить(75,"K");
	КодировкаОбратная.Вставить(76,"L");
	КодировкаОбратная.Вставить(77,"M");
	КодировкаОбратная.Вставить(78,"N");
	КодировкаОбратная.Вставить(79,"O");
	КодировкаОбратная.Вставить(80,"P");
	КодировкаОбратная.Вставить(81,"Q");
	КодировкаОбратная.Вставить(82,"R");
	КодировкаОбратная.Вставить(83,"S");
	КодировкаОбратная.Вставить(84,"T");
	КодировкаОбратная.Вставить(85,"U");
	КодировкаОбратная.Вставить(86,"V");
	КодировкаОбратная.Вставить(87,"W");
	КодировкаОбратная.Вставить(88,"X");
	КодировкаОбратная.Вставить(89,"Y");
	КодировкаОбратная.Вставить(90,"Z");
	КодировкаОбратная.Вставить(91,"[");
	КодировкаОбратная.Вставить(92,"\");
	КодировкаОбратная.Вставить(93,"]");
	КодировкаОбратная.Вставить(94,"^");
	КодировкаОбратная.Вставить(95,"_");
	КодировкаОбратная.Вставить(96,"`");
	КодировкаОбратная.Вставить(97,"a");
	КодировкаОбратная.Вставить(98,"b");
	КодировкаОбратная.Вставить(99,"c");
	КодировкаОбратная.Вставить(100,"d");
	КодировкаОбратная.Вставить(101,"e");
	КодировкаОбратная.Вставить(102,"f");
	КодировкаОбратная.Вставить(103,"g");
	КодировкаОбратная.Вставить(104,"h");
	КодировкаОбратная.Вставить(105,"i");
	КодировкаОбратная.Вставить(106,"j");
	КодировкаОбратная.Вставить(107,"k");
	КодировкаОбратная.Вставить(108,"l");
	КодировкаОбратная.Вставить(109,"m");
	КодировкаОбратная.Вставить(110,"n");
	КодировкаОбратная.Вставить(111,"o");
	КодировкаОбратная.Вставить(112,"p");
	КодировкаОбратная.Вставить(113,"q");
	КодировкаОбратная.Вставить(114,"r");
	КодировкаОбратная.Вставить(115,"s");
	КодировкаОбратная.Вставить(116,"t");
	КодировкаОбратная.Вставить(117,"u");
	КодировкаОбратная.Вставить(118,"v");
	КодировкаОбратная.Вставить(119,"w");
	КодировкаОбратная.Вставить(120,"x");
	КодировкаОбратная.Вставить(121,"y");
	КодировкаОбратная.Вставить(122,"z");
	КодировкаОбратная.Вставить(123,"{");
	КодировкаОбратная.Вставить(124,"|");
	КодировкаОбратная.Вставить(125,"}");
	КодировкаОбратная.Вставить(126,"~");
	КодировкаОбратная.Вставить(127,"");
	КодировкаОбратная.Вставить(128,"Ђ");
	КодировкаОбратная.Вставить(129,"Ѓ");
	КодировкаОбратная.Вставить(130,"‚");
	КодировкаОбратная.Вставить(131,"ѓ");
	КодировкаОбратная.Вставить(132,"„");
	КодировкаОбратная.Вставить(133,"…");
	КодировкаОбратная.Вставить(134,"†");
	КодировкаОбратная.Вставить(135,"‡");
	КодировкаОбратная.Вставить(136,"€");
	КодировкаОбратная.Вставить(137,"‰");
	КодировкаОбратная.Вставить(138,"Љ");
	КодировкаОбратная.Вставить(139,"‹");
	КодировкаОбратная.Вставить(140,"Њ");
	КодировкаОбратная.Вставить(141,"Ќ");
	КодировкаОбратная.Вставить(142,"Ћ");
	КодировкаОбратная.Вставить(143,"Џ");
	КодировкаОбратная.Вставить(144,"ђ");
	КодировкаОбратная.Вставить(145,"‘");
	КодировкаОбратная.Вставить(146,"’");
	КодировкаОбратная.Вставить(147,"“");
	КодировкаОбратная.Вставить(148,"”");
	КодировкаОбратная.Вставить(149,"•");
	КодировкаОбратная.Вставить(150,"–");
	КодировкаОбратная.Вставить(151,"—");
	КодировкаОбратная.Вставить(152,"");
	КодировкаОбратная.Вставить(153,"™");
	КодировкаОбратная.Вставить(154,"љ");
	КодировкаОбратная.Вставить(155,"›");
	КодировкаОбратная.Вставить(156,"њ");
	КодировкаОбратная.Вставить(157,"ќ");
	КодировкаОбратная.Вставить(158,"ћ");
	КодировкаОбратная.Вставить(159,"џ");
	КодировкаОбратная.Вставить(160," ");
	КодировкаОбратная.Вставить(161,"Ў");
	КодировкаОбратная.Вставить(162,"ў");
	КодировкаОбратная.Вставить(163,"Ј");
	КодировкаОбратная.Вставить(164,"¤");
	КодировкаОбратная.Вставить(165,"Ґ");
	КодировкаОбратная.Вставить(166,"¦");
	КодировкаОбратная.Вставить(167,"§");
	КодировкаОбратная.Вставить(168,"Ё");
	КодировкаОбратная.Вставить(169,"©");
	КодировкаОбратная.Вставить(170,"Є");
	КодировкаОбратная.Вставить(171,"«");
	КодировкаОбратная.Вставить(172,"¬");
	КодировкаОбратная.Вставить(173,"");
	КодировкаОбратная.Вставить(174,"®");
	КодировкаОбратная.Вставить(175,"Ї");
	КодировкаОбратная.Вставить(176,"°");
	КодировкаОбратная.Вставить(177,"±");
	КодировкаОбратная.Вставить(178,"І");
	КодировкаОбратная.Вставить(179,"і");
	КодировкаОбратная.Вставить(180,"ґ");
	КодировкаОбратная.Вставить(181,"µ");
	КодировкаОбратная.Вставить(182,"¶");
	КодировкаОбратная.Вставить(183,"·");
	КодировкаОбратная.Вставить(184,"ё");
	КодировкаОбратная.Вставить(185,"№");
	КодировкаОбратная.Вставить(186,"є");
	КодировкаОбратная.Вставить(187,"»");
	КодировкаОбратная.Вставить(188,"ј");
	КодировкаОбратная.Вставить(189,"Ѕ");
	КодировкаОбратная.Вставить(190,"ѕ");
	КодировкаОбратная.Вставить(191,"ї");
	КодировкаОбратная.Вставить(192,"А");
	КодировкаОбратная.Вставить(193,"Б");
	КодировкаОбратная.Вставить(194,"В");
	КодировкаОбратная.Вставить(195,"Г");
	КодировкаОбратная.Вставить(196,"Д");
	КодировкаОбратная.Вставить(197,"Е");
	КодировкаОбратная.Вставить(198,"Ж");
	КодировкаОбратная.Вставить(199,"З");
	КодировкаОбратная.Вставить(200,"И");
	КодировкаОбратная.Вставить(201,"Й");
	КодировкаОбратная.Вставить(202,"К");
	КодировкаОбратная.Вставить(203,"Л");
	КодировкаОбратная.Вставить(204,"М");
	КодировкаОбратная.Вставить(205,"Н");
	КодировкаОбратная.Вставить(206,"О");
	КодировкаОбратная.Вставить(207,"П");
	КодировкаОбратная.Вставить(208,"Р");
	КодировкаОбратная.Вставить(209,"С");
	КодировкаОбратная.Вставить(210,"Т");
	КодировкаОбратная.Вставить(211,"У");
	КодировкаОбратная.Вставить(212,"Ф");
	КодировкаОбратная.Вставить(213,"Х");
	КодировкаОбратная.Вставить(214,"Ц");
	КодировкаОбратная.Вставить(215,"Ч");
	КодировкаОбратная.Вставить(216,"Ш");
	КодировкаОбратная.Вставить(217,"Щ");
	КодировкаОбратная.Вставить(218,"Ъ");
	КодировкаОбратная.Вставить(219,"Ы");
	КодировкаОбратная.Вставить(220,"Ь");
	КодировкаОбратная.Вставить(221,"Э");
	КодировкаОбратная.Вставить(222,"Ю");
	КодировкаОбратная.Вставить(223,"Я");
	КодировкаОбратная.Вставить(224,"а");
	КодировкаОбратная.Вставить(225,"б");
	КодировкаОбратная.Вставить(226,"в");
	КодировкаОбратная.Вставить(227,"г");
	КодировкаОбратная.Вставить(228,"д");
	КодировкаОбратная.Вставить(229,"е");
	КодировкаОбратная.Вставить(230,"ж");
	КодировкаОбратная.Вставить(231,"з");
	КодировкаОбратная.Вставить(232,"и");
	КодировкаОбратная.Вставить(233,"й");
	КодировкаОбратная.Вставить(234,"к");
	КодировкаОбратная.Вставить(235,"л");
	КодировкаОбратная.Вставить(236,"м");
	КодировкаОбратная.Вставить(237,"н");
	КодировкаОбратная.Вставить(238,"о");
	КодировкаОбратная.Вставить(239,"п");
	КодировкаОбратная.Вставить(240,"р");
	КодировкаОбратная.Вставить(241,"с");
	КодировкаОбратная.Вставить(242,"т");
	КодировкаОбратная.Вставить(243,"у");
	КодировкаОбратная.Вставить(244,"ф");
	КодировкаОбратная.Вставить(245,"х");
	КодировкаОбратная.Вставить(246,"ц");
	КодировкаОбратная.Вставить(247,"ч");
	КодировкаОбратная.Вставить(248,"ш");
	КодировкаОбратная.Вставить(249,"щ");
	КодировкаОбратная.Вставить(250,"ъ");
	КодировкаОбратная.Вставить(251,"ы");
	КодировкаОбратная.Вставить(252,"ь");
	КодировкаОбратная.Вставить(253,"э");
	КодировкаОбратная.Вставить(254,"ю");
	КодировкаОбратная.Вставить(255,"я");
	
	Возврат Новый Структура("КодировкаПрямая, КодировкаОбратная", КодировкаПрямая, КодировкаОбратная);
	
КонецФункции

#КонецОбласти
